In [1]:
# 데이터 합치기 Merging(병합)
import pandas as pd
import numpy as np

df1 = pd.DataFrame({'key' : list('bbacaab'), 'data1' : range(7)})
df2 = pd.DataFrame({'key' : list('abd'), 'data2' : range(3)})

In [2]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [3]:
df2

  key  data2
0   a      0
1   b      1
2   d      2

In [4]:
pd.merge(df1, df2, on='key')

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [5]:
# how='outer'로 한쪽만 있는 데이터도 출력, 없는쪽은 NaN으로 출력
pd.merge(df1, df2, on='key', how='outer')

  key  data1  data2
0   b    0.0    1.0
1   b    1.0    1.0
2   b    6.0    1.0
3   a    2.0    0.0
4   a    4.0    0.0
5   a    5.0    0.0
6   c    3.0    NaN
7   d    NaN    2.0

In [6]:
# how='left'로 df1이 기준이되어 고정되며 df2에 데이터가 없으면 NaN이 출력
# how='right'도 있으며 반대로 df2가 고정이되어 df1에 데이터가 없으면 NaN이 출력
pd.merge(df1, df2, on='key', how='left')

  key  data1  data2
0   b      0    1.0
1   b      1    1.0
2   a      2    0.0
3   c      3    NaN
4   a      4    0.0
5   a      5    0.0
6   b      6    1.0

In [7]:
df3 = pd.DataFrame({'key' : list('bbacaab'), 'data1' : range(7)})
df4 = pd.DataFrame({'key' : list('ababd'), 'data2' : range(5)})

In [8]:
df3

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [9]:
df4

  key  data2
0   a      0
1   b      1
2   a      2
3   b      3
4   d      4

In [10]:
# how='inner' 공통된 값이 없으면 생략
pd.merge(df3, df4, on='key', how='inner')

   key  data1  data2
0    b      0      1
1    b      0      3
2    b      1      1
3    b      1      3
4    b      6      1
5    b      6      3
6    a      2      0
7    a      2      2
8    a      4      0
9    a      4      2
10   a      5      0
11   a      5      2

In [11]:
df5 = pd.DataFrame({'lkey' : list('bbacaab'), 'data1' : range(7)})
df6 = pd.DataFrame({'rkey' : list('abd'), 'data2' : range(3)})

In [12]:
df5

  lkey  data1
0    b      0
1    b      1
2    a      2
3    c      3
4    a      4
5    a      5
6    b      6

In [13]:
df6

  rkey  data2
0    a      0
1    b      1
2    d      2

In [14]:
# 왼쪽 df5의 lkey 와 오른쪽 df6의 rkey를 기준으로 값이 같은 것들끼리 출력
pd.merge(df5, df6, left_on='lkey', right_on='rkey')

  lkey  data1 rkey  data2
0    b      0    b      1
1    b      1    b      1
2    b      6    b      1
3    a      2    a      0
4    a      4    a      0
5    a      5    a      0

In [15]:
# index를 기준으로 merging
left1 = pd.DataFrame({'key' : ['a', 'b', 'a', 'a', 'b', 'c'], 'value' : range(6)})
right1 = pd.DataFrame({'group_val' : [3.5, 7]}, index = ['a', 'b'])

In [16]:
left1

  key  value
0   a      0
1   b      1
2   a      2
3   a      3
4   b      4
5   c      5

In [17]:
right1

   group_val
a        3.5
b        7.0

In [18]:
# right_on을 right_index로 바꿔서 index 기준으로 값을 출력
pd.merge(left1, right1, left_on='key', right_index=True)

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0

In [19]:
# DataFrame 둘다 index를 기준으로 merging
left2 = pd.DataFrame([[1., 2.], [3., 4.], [5., 6.]], index=['a', 'c', 'e'], columns=['seoul', 'incheon'])
right2 = pd.DataFrame([[7., 8.], [9., 10.], [11., 12.], [13, 14]], index=['b', 'c', 'd', 'e'], columns=['daegu', 'busan'])

In [20]:
left2

   seoul  incheon
a    1.0      2.0
c    3.0      4.0
e    5.0      6.0

In [21]:
right2

   daegu  busan
b    7.0    8.0
c    9.0   10.0
d   11.0   12.0
e   13.0   14.0

In [22]:
# how='outer'를 넣어서 공통된 값이 없는 행들도 출력
pd.merge(left2, right2, how='outer', left_index=True, right_index=True)

   seoul  incheon  daegu  busan
a    1.0      2.0    NaN    NaN
b    NaN      NaN    7.0    8.0
c    3.0      4.0    9.0   10.0
d    NaN      NaN   11.0   12.0
e    5.0      6.0   13.0   14.0

In [23]:
# 데이터 합치기 Concatenating(연결)
import pandas as pd

s1 = pd.Series([0, 1], index=['a', 'b'])
s2 = pd.Series([2, 3, 4], index=['c', 'd', 'e'])
s3 = pd.Series([5, 6], index=['f', 'g'])

In [24]:
s1

a    0
b    1
dtype: int64

In [25]:
s2

c    2
d    3
e    4
dtype: int64

In [26]:
s3

f    5
g    6
dtype: int64

In [27]:
# concat() 함수를 이용해서 리스트형식으로 데이터 합치기
pd.concat([s1, s2, s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

In [28]:
# axis=1 로 열 방향 연결 데이터가 없는 행은 NaN 출력
pd.concat([s1, s2, s3], axis=1)

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0

In [29]:
s4 = pd.concat([s1 * 5, s3])

In [30]:
s4

a    0
b    5
f    5
g    6
dtype: int64

In [31]:
# 동일한 index가 있을 경우 같은 열에 출력
pd.concat([s1, s4], axis=1)

     0  1
a  0.0  0
b  1.0  5
f  NaN  5
g  NaN  6

In [32]:
# 여러개의 Series를 concat()으로 연결시 DataFrame 에다 컬럼명을 명시
pd.concat([s1, s2, s3], axis=1, keys=['one', 'two', 'three'])

   one  two  three
a  0.0  NaN    NaN
b  1.0  NaN    NaN
c  NaN  2.0    NaN
d  NaN  3.0    NaN
e  NaN  4.0    NaN
f  NaN  NaN    5.0
g  NaN  NaN    6.0

In [33]:
# DataFrame에서도 동일한 방법으로 연결 할 수 있다
df1 = pd.DataFrame(np.arange(6).reshape(3, 2), index=['a', 'b', 'c'], columns=['one', 'two'])
df2 = pd.DataFrame(5 + np.arange(4).reshape(2, 2), index=['a', 'c'], columns=['three', 'four'])

In [34]:
df1

   one  two
a    0    1
b    2    3
c    4    5

In [35]:
df2

   three  four
a      5     6
c      7     8

In [36]:
# DataFrame 두개를 열 방향으로 연결
pd.concat([df1, df2], axis=1)

   one  two  three  four
a    0    1    5.0   6.0
b    2    3    NaN   NaN
c    4    5    7.0   8.0

In [37]:
df3 = pd.DataFrame(np.random.randn(3, 4), columns=['a', 'b', 'c', 'd'])
df4 = pd.DataFrame(np.random.randn(2, 3), columns=['b', 'd', 'a'])

In [38]:
df3

          a         b         c         d
0  2.043266 -1.196338 -0.472274  0.321454
1  0.100148 -0.456039 -0.196013  1.046892
2 -0.967359  0.582639  0.314070  1.486398

In [39]:
df4

          b         d         a
0 -0.431181 -0.222551  0.932699
1  1.215823  0.755620 -1.190849

In [40]:
# ignore_index=True 를 통해 기존 index를 신경쓰지 않고 연결
pd.concat([df3, df4], ignore_index=True)

          a         b         c         d
0  2.043266 -1.196338 -0.472274  0.321454
1  0.100148 -0.456039 -0.196013  1.046892
2 -0.967359  0.582639  0.314070  1.486398
3  0.932699 -0.431181       NaN -0.222551
4 -1.190849  1.215823       NaN  0.755620

In [41]:
pd.concat([df3, df4])

          a         b         c         d
0  2.043266 -1.196338 -0.472274  0.321454
1  0.100148 -0.456039 -0.196013  1.046892
2 -0.967359  0.582639  0.314070  1.486398
0  0.932699 -0.431181       NaN -0.222551
1 -1.190849  1.215823       NaN  0.755620